app/views/questions/_form.html.erb


        <% Hashtag.all.each do |tag| %>
---
SELECT "hashtags".* FROM "hashtags"