app/views/questions/show.html.erb


<% if @question.tallies.length == 0 %>
---
SELECT "tallies".* FROM "tallies" WHERE "tallies"."question_id" = $1  [["question_id", 16]]