app/views/users/show.html.erb

        <h4><%= @current_user.name %> answered the following...</h4>
        <% @current_user.tallies.each do | tally | %>
---
SELECT "tallies".* FROM "tallies" WHERE "tallies"."user_id" = $1  [["user_id", 36]]