app/controllers/questions_controller.rb

  def show

    @question = Question.find params[:id]

    @opt_a_total = @question.tallies.where(question_answer: true).length
    @opt_a_as_percentage = @opt_a_total.to_f / @question.tallies.length * 100

    @opt_b_total = @question.tallies.where(question_answer: false).length
    @opt_b_as_percentage = @opt_b_total.to_f / @question.tallies.length * 100
---
SELECT "tallies".* FROM "tallies" WHERE "tallies"."question_id" = $1 AND "tallies"."question_answer" = $2  [["question_id", 35], ["question_answer", true]]
SELECT "tallies".* FROM "tallies" WHERE "tallies"."question_id" = $1 AND "tallies"."question_answer" = $2  [["question_id", 35], ["question_answer", false]]
SELECT "tallies".* FROM "tallies" WHERE "tallies"."question_id" = $1 AND "tallies"."question_answer" = $2  [["question_id", 29], ["question_answer", true]]