app/controllers/questions_controller.rb

INSERT INTO "questions" ("opt_A", "opt_B", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["opt_A", "a"], ["opt_B", "b"], ["created_at", "2022-09-01 06:06:07.904659"], ["updated_at", "2022-09-01 06:06:07.904659"], ["user_id", 76]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."id" IN ($1, $2, $3)  [["id", 105], ["id", 106], ["id", 107]]
---
  def create
    # raise 'hell'
    @question = Question.new question_params
    @question.user_id = @current_user.id
    if params[:question][:thumbnail_image].present?

      response = Cloudinary::Uploader.upload params[:question][:thumbnail_image]
      @question.thumbnail_image = response['public_id']

    end

    # TO DO - VALIDATION CHECKING
    if params[:hashtag_ids].present? && params[:hashtag_ids].length > 1

      @question.save
      @question.hashtags << Hashtag.find(params[:hashtag_ids])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 143], ["LIMIT", 1]]
SELECT "tallies".* FROM "tallies" WHERE "tallies"."question_id" = $1 AND "tallies"."question_answer" = $2  [["question_id", 160], ["question_answer", true]]
SELECT "tallies".* FROM "tallies" WHERE "tallies"."question_id" = $1 AND "tallies"."question_answer" = $2  [["question_id", 119], ["question_answer", false]]
SELECT "tallies".* FROM "tallies" WHERE "tallies"."question_id" = $1 AND "tallies"."question_answer" = $2  [["question_id", 160], ["question_answer", false]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 79], ["LIMIT", 1]]
---
  def show

    @question = Question.find params[:id]

    @opt_a_total = @question.tallies.where(question_answer: true).length
    @opt_a_as_percentage = @opt_a_total.to_f / @question.tallies.length * 100

    @opt_b_total = @question.tallies.where(question_answer: false).length
    @opt_b_as_percentage = @opt_b_total.to_f / @question.tallies.length * 100

SELECT "tallies".* FROM "tallies" WHERE "tallies"."user_id" = $1  [["user_id", 85]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 150], ["LIMIT", 1]]
SELECT "hashtags"."id" FROM "hashtags" INNER JOIN "hashtags_questions" ON "hashtags"."id" = "hashtags_questions"."hashtag_id" WHERE "hashtags_questions"."question_id" = $1  [["question_id", 150]]
SELECT "questions".* FROM "questions" INNER JOIN "hashtags_questions" ON "hashtags_questions"."question_id" = "questions"."id" INNER JOIN "hashtags" ON "hashtags"."id" = "hashtags_questions"."hashtag_id" WHERE "hashtags"."id" IN ($1, $2, $3)  [["id", 129], ["id", 124], ["id", 127]]
SELECT  "questions".* FROM "questions" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def random

    if @current_user.present? && @current_user.tallies.length > 3

      # in order to ensure fresh selection, reset hashtag_ids to 'nil' at beginning
      hashtag_ids = nil

      # obtains IDs of each question answered via the shared 'tallies' table
      answered_q_ids = @current_user.tallies.pluck(:question_id).uniq

      # use question IDs to obtain IDs of hashtags associated with each question
      hashtag_ids = answered_q_ids.map do |q_id|

          Question.find(q_id).hashtags.ids

      end

      # rearrange data into useable state
      hashtag_pref = hashtag_ids.flatten.tally.sort_by{|item|item[1]}.reverse[0..2]

      # further tidy - should show the id of the user's 3 most interacted with hashtags
      hashtag_pref = hashtag_pref[0].zip(hashtag_pref[1],hashtag_pref[2])[0]

      # use the preferrence hashtag ids to create an array of questions
      # by matching hashtags to questions
      pref_as_array = Question.joins(:hashtags).where(hashtags:{id:hashtag_pref}).uniq

      # next, filter out questions that have already been answered by
      # comparing with the previously assembled IDs of answered questions.
      possible_qs = pref_as_array.select do |question|

SELECT "questions".* FROM "questions" ORDER BY RANDOM()
---
        def self.random_question

            Question.order('RANDOM()').first

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 192], ["LIMIT", 1]]
---
  def edit
    @question = Question.find params[:id]

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 119], ["LIMIT", 1]]
---
  def update

    @question = Question.find params[:id]

DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 43]]
---
  def destroy
    Question.destroy params[:id]