app/controllers/tallies_controller.rb

  def create
    choice = params[:choice] == 'A'
    Tally.create!(
      user_id: @current_user.id,
      question_id: params[:question_id],
      question_answer: choice
    )
---
INSERT INTO "tallies" ("user_id", "question_id", "question_answer", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 7], ["question_id", 14], ["question_answer", false], ["created_at", "2022-08-29 02:48:10.287921"], ["updated_at", "2022-08-29 02:48:10.287921"]]