app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "dob", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create

    @user = User.create user_params     # strong params